app/controllers/api/tabs_controller.rb

    def create
      @tab = Tab.new(tab_params)
      @tab.user_id = current_user.id

      if @tab.save
---
INSERT INTO "tabs" ("title", "date", "total_amount", "tag", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def show
      @tab = Tab.find(params[:id])

      if current_user.tabs.include?(@tab)
---
SELECT  "tabs".* FROM "tabs" WHERE "tabs"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "tabs".* FROM "tabs" WHERE "tabs"."user_id" = $1 AND "tabs"."id" = $2  [["user_id", 1], ["id", 6]]

    def update
      @tab = Tab.find(params[:id])

      if @tab.update(tab_params)
---
SELECT  "tabs".* FROM "tabs" WHERE "tabs"."id" = $1 LIMIT 1  [["id", 26]]
UPDATE "tabs" SET "title" = $1, "tag" = $2, "updated_at" = $3 WHERE "tabs"."id" = $4  [["title", "editing"], ["tag", "please"], ["updated_at", "2015-02-05 19:17:46.300329"], ["id", 28]]