app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "patapat@gmail.com"]]
---
  def create
    if env["omniauth.auth"]
      @user = User.from_omniauth(env["omniauth.auth"])
    else
      @user = User.find_by_credentials(
        params[:user][:email],
        params[:user][:password]
      )
      @user = User.first if params[:user][:email] == ""