app/controllers/tabs_controller.rb

INSERT INTO "tabs" ("title", "date", "total_amount", "tag", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @tab = Tab.new(tab_params)
    @tab.user_id = current_user.id

    if @tab.save

SELECT  "tabs".* FROM "tabs" WHERE "tabs"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "tabs" WHERE "tabs"."id" = $1  [["id", 1]]
---
  def destroy
    @tab = Tab.find(params[:id])
    @tab.destroy

SELECT  "tabs".* FROM "tabs" WHERE "tabs"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @tab = Tab.find(params[:id])

SELECT  "tabs".* FROM "tabs" WHERE "tabs"."id" = $1 LIMIT 1  [["id", 4]]
---
  def edit
    @tab = Tab.find(params[:id])

SELECT  "tabs".* FROM "tabs" WHERE "tabs"."id" = $1 LIMIT 1  [["id", 7]]
UPDATE "tabs" SET "title" = $1, "updated_at" = $2 WHERE "tabs"."id" = $3  [["title", "7th tab UPDATED FOR REAL"], ["updated_at", "2015-02-03 23:41:14.850668"], ["id", 7]]
---
  def update
    @tab = Tab.find(params[:id])

    if @tab.update(tab_params)